---
kind: property
id: P:Autodesk.Revit.DB.NumberSystem.JustifyOption
source: html/51831cce-9730-2b4f-2be5-5700f951170e.htm
---
# Autodesk.Revit.DB.NumberSystem.JustifyOption Property

The number justify option of number system.

## Syntax (C#)
```csharp
public NumberSystemJustifyOption JustifyOption { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration